Revit 2027 API
AnnotationFamilyUtils.IsLeaderSnapReference Method
 Checks if the element is a leader snap reference for annotation leader snapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsLeaderSnapReference(
	Element element
)
Public Shared Function IsLeaderSnapReference (
	element As Element
) As Boolean
public:
static bool IsLeaderSnapReference(
	Element^ element
)
static member IsLeaderSnapReference :
        element : Element -> bool
Parameters
element Element
 The element to check.
Return Value
Boolean
 True if the element is a leader snap reference, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  element doesn't support the LEADER_SNAP_REFERENCE parameter.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function controls the built-in parameter LEADER_SNAP_REFERENCE.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace